[
  {
    "id": 1,
    "slug": "geliyoo-search-engine-revolution-for-turkey",
    "title": "Empowering Geliyoo to Build the Future of Turkey’s Search and Digital Services",
    "subtitle": "Enabling Turkey’s National Digital Search Ecosystem",
    "client": "Geliyoo Bilişim",
    "industry": "Technology & Internet Services",
    "location": "Turkey",
    "services": [
      "Product Development",
      "Search Engine Development",
      "Maps Integration",
      "Browser Development",
      "Strategic Consulting"
    ],
    "technologies": [
      "Elasticsearch",
      "React",
      "Node.js",
      "AWS",
      "MongoDB",
      "Redis",
      "Chromium"
    ],
    "duration": "18 months",
    "teamSize": "25+ Engineers",
    "overview": "A visionary Turkish tech company needed a reliable, multi-skilled, and budget-aligned technology partner. Our team stepped in to architect, guide, and manage their entire digital ecosystem — from search to maps, browser, and beyond.",
    "clientOverview": {
      "title": "Client Overview: Geliyoo Bilişim",
      "description": "Geliyoo Bilişim, founded on 18 November 2010 by Buray Anıl Savaş and Fatih Arslan, is a Turkish company specializing in Internet-driven products and services. Their portfolio includes a national search engine, a news aggregator, RSS-based systems, and a web browser (in development). With headquarters in Turkey and led by key executives such as CEO Hakan Atabaş, Geliyoo aims to build a Turkish-first digital ecosystem capable of competing with global giants — personalized for local culture, language, and user needs. Over the years, they have invested significantly into research, testing, and infrastructure, with several public launches in 2013 and a major search engine update in 2017."
    },
    "challenge": {
      "title": "The Challenge",
      "description": "Geliyoo’s leadership had a bold vision: Create multiple large-scale digital products in parallel. However, they faced several obstacles:",
      "points": [
        "High development costs quoted by major vendors.",
        "Multiple complex projects running at the same time (Search Engine, News Portal, Maps, Browser).",
        "Difficulty finding a single partner capable of handling end-to-end development.",
        "A need for technical architecture, planning, vendor coordination, and quality assurance.",
        "Desire for a partner who could work within their budget while still delivering high-quality output."
      ],
      "conclusion": "Geliyoo needed more than developers — They needed a strategic technology partner who could bring order, clarity, and reliable execution.",
      "image": "/assets/case-studies/geliyoo/challenge.png"
    },
    "solution": {
      "title": "Our Solution",
      "description": "Our team collaborated closely with Geliyoo’s leadership to understand the entire ecosystem they wanted to build. We positioned ourselves not just as a vendor, but as a full-cycle technology consulting and execution partner.",
      "steps": [
        {
          "title": "1. Discovery & Strategic Consulting",
          "description": "We conducted several rounds of discussions with the founders and CEO to understand their vision, product roadmap, limitations, technical challenges, and expected timelines and budget. We ensured full transparency about our capabilities, technology stack, and execution methods — which immediately built trust."
        },
        {
          "title": "2. Creating Detailed Scopes for All Projects",
          "description": "We prepared complete documentation for Geliyoo Search Engine, Geliyoo Maps, Geliyoo News Portal, Geliyoo Browser, Internal backend systems, and Infrastructure recommendations. This provided Geliyoo a structured project roadmap for the first time."
        },
        {
          "title": "3. Vendor Association & Team Identification",
          "description": "We built a Vendor Association Valuation Sheet to identify the right development teams, match technology skill sets with Geliyoo’s objectives, align cost expectations with realistic requirements, and select trusted partners from India who could collaborate long-term. Within 2 months, we assembled the right team for each major component."
        },
        {
          "title": "4. Execution, Monitoring & Quality Control",
          "description": "Once the development teams were finalized, we took full responsibility for coordinating multiple vendors, defining milestones, monitoring technical progress, ensuring continuous quality control, reducing managerial load on the client, and eliminating communication gaps. This gave Geliyoo the confidence and stability needed to proceed with large-scale development."
        }
      ],
      "image": "/assets/case-studies/geliyoo/solution.png"
    },
    "impact": {
      "title": "Impact Delivered",
      "description": "Our strategic partnership delivered measurable results:",
      "points": [
        "Multiple Geliyoo products successfully developed and launched",
        "Remaining products are in structured, active development",
        "The client now has a clear long-term digital ecosystem roadmap",
        "Execution is faster and more reliable due to coordinated vendor management",
        "The leadership team no longer handles day-to-day technical stress — we do",
        "A strong India–Turkey collaboration ecosystem is established"
      ],
      "conclusion": "Most importantly, we helped Geliyoo move closer to its national mission: Bringing Turkey its own independent, culturally aligned digital search platform.",
      "image": "/assets/case-studies/geliyoo/impact.png"
    },
    "imageUrl": "/assets/case-studies/geliyoo/hero.png",
    "bannerImage": "/assets/case-studies/geliyoo/hero.png",
    "stats": [
      {
        "value": "4+",
        "label": "Products Launched"
      },
      {
        "value": "50%",
        "label": "Cost Saved"
      },
      {
        "value": "10M+",
        "label": "Daily Queries"
      },
      {
        "value": "99.9%",
        "label": "Uptime"
      }
    ],
    "quote": {
      "text": "A national search engine is more than a product. It is a statement that digital sovereignty matters.",
      "author": "Cyber Governance Expert"
    },
    "gradient": "from-violet-500 to-purple-600",
    "icon": "search"
  },
  {
    "id": 2,
    "slug": "orabel-ecommerce-platform-for-beauty-products",
    "title": "Transforming a Growing Beauty Brand Into a High-Performance, Scalable Digital Storefront",
    "subtitle": "Pioneers of Beauty in Canada – Orabel",
    "client": "Orabel",
    "industry": "E-commerce & Beauty",
    "location": "Canada",
    "services": [
      "Platform Migration",
      "UI/UX Design",
      "SEO Optimization",
      "Performance Enhancement"
    ],
    "technologies": [
      "Magento 2",
      "PHP",
      "MySQL",
      "Elasticsearch",
      "Redis",
      "Varnish Cache"
    ],
    "duration": "9 months",
    "teamSize": "12+ Specialists",
    "overview": "Orabel, a fast-growing beauty brand in Canada, was attracting massive customer attention — but their website could not keep up. Coreway stepped in to rebuild, optimize, and elevate their entire digital commerce experience, making it faster, smoother, and ready for exponential growth.",
    "clientOverview": {
      "title": "Overview",
      "description": "Orabel has established itself as one of Canada's emerging leaders in beauty and cosmetics. Their product catalog expands rapidly, their customer community is active and loyal, and their online brand presence is strong. But when you're pioneering the beauty market, technology must evolve as fast as your customers do. To sustain their growth and offer a superior shopping experience, Orabel needed a stable, scalable, and modern ecommerce foundation."
    },
    "challenge": {
      "title": "The Challenge",
      "description": "Delivering exactly what modern shoppers expect — when they expect it — at a price they can afford is the core of ecommerce success. But achieving this is impossible without reliable technology. Orabel faced several issues:",
      "points": [
        "Their webstore slowed down dramatically whenever new SKUs were added",
        "High bounce rates due to slow loading pages",
        "A painfully long checkout process, causing serious cart abandonment",
        "Website performance dropped during traffic spikes",
        "Customers demanded smooth navigation, fast browsing, and easy payment options"
      ],
      "conclusion": "These challenges affected sales, user satisfaction, and overall brand trust. Frustrated with ongoing technical problems, Orabel turned to the team they trusted most — Coreway — to rebuild their digital storefront and bring their brand vision to life.",
      "image": "/assets/case-studies/orabel/challenge.png"
    },
    "solution": {
      "title": "Our Solution",
      "description": "Coreway partnered closely with Orabel to realign their digital strategy and deliver a future-ready ecommerce experience.",
      "steps": [
        {
          "title": "1. Technology Assessment & Migration",
          "description": "Using analytics and performance audits, we identified the root issues: High bounce rate caused by slow pages, checkout abandonment due to lengthy funnels, and platform limits restricting scalability. We recommended a complete migration to Magento 2, a robust and scalable enterprise-grade ecommerce platform."
        },
        {
          "title": "2. Full Website Migration & Optimization",
          "description": "Coreway took full responsibility for: Migrating the website from the old platform to Magento 2, rebuilding the architecture for speed and stability, optimizing server performance and caching, and reducing page load time significantly."
        },
        {
          "title": "3. Enhanced UI/UX for Superior Shopping Experience",
          "description": "To elevate user engagement, we redesigned: Product listings, navigation and filters, checkout flow, and mobile responsiveness. Every enhancement was driven by behavioral analytics and customer expectations."
        },
        {
          "title": "4. SEO & Brand Communication Overhaul",
          "description": "Coreway optimized: Meta tags and on-page SEO, technical SEO structure, content flow, social media link visibility, and brand communication across pages and channels. This improved Orabel's visibility across search engines and local markets."
        }
      ],
      "image": "/assets/case-studies/orabel/hero.png"
    },
    "impact": {
      "title": "Impact Delivered",
      "description": "Within the first quarter of implementation, Orabel saw extraordinary improvements:",
      "points": [
        "#1 Rankings in key local search areas",
        "20% Faster Website Speed",
        "5X Increase in Visitors",
        "3X Increase in Sales"
      ],
      "conclusion": "Coreway didn't just fix performance issues — we helped Orabel scale into a thriving, high-conversion ecommerce brand.",
      "image": "/assets/case-studies/orabel/hero.png"
    },
    "imageUrl": "/assets/case-studies/orabel/hero.png",
    "bannerImage": "/assets/case-studies/orabel/hero.png",
    "stats": [
      {
        "value": "#1",
        "label": "Local Rankings"
      },
      {
        "value": "20%",
        "label": "Faster Speed"
      },
      {
        "value": "5X",
        "label": "More Visitors"
      },
      {
        "value": "3X",
        "label": "Sales Increase"
      }
    ],
    "testimonial": {
      "quote": "I got a much better website, which is not bugging anymore. It's way faster than before and now I also have better SEO. I know that because my site and my social links now rank on top everywhere. That's amazing! I am not a developer so all this technology stuff sounds Greek to me. That's why I used to be wary of freelancers — they gave poor quality and charged me a fortune. But Varun and Coreway are someone I can completely rely on. I trust you with any of my development projects because I know you'll never rip me off like others do. Thank you for making my webstore awesome again and increasing my sales. :)",
      "author": "Orabel Founder",
      "position": "",
      "image": "/assets/review/orabel-founder.png"
    },
    "quote": {
      "text": "The details are not the details. They make the design.",
      "author": "Charles Eames"
    },
    "gradient": "from-pink-500 to-rose-600",
    "icon": "trending"
  },
  {
    "id": 3,
    "slug": "candidateverification-streamlining-verification-process",
    "title": "Streamlining the Candidate Verification Process for CandidateVerification.org",
    "subtitle": "Automating Political Transparency Through Technology",
    "client": "CandidateVerification.org",
    "industry": "Non-Profit & Public Service",
    "location": "United States",
    "services": [
      "Custom Platform Development",
      "API Integration",
      "Workflow Automation",
      "Database Design"
    ],
    "technologies": [
      "NationBuilder",
      "PHP",
      "HTML/CSS",
      "jQuery",
      "Webhooks",
      "REST APIs"
    ],
    "duration": "6 months",
    "teamSize": "8+ Developers",
    "overview": "CandidateVerification.org is a recognized 501(c)(3) public charity promoting transparency in public office by offering free background checks and résumé verifications for election candidates. Coreway automated their entire verification pipeline, reducing manual work by 80%.",
    "clientOverview": {
      "title": "Client Introduction",
      "description": "CandidateVerification.org is a recognized 501(c)(3) public charity in the United States. Their mission is to promote transparency in public office by offering free background checks and résumé verifications for candidates running for election. Their screenings include 10-year criminal & civil record checks, verification of academic qualifications, employment & professional background verification, and military service verification. Their vision is simple yet powerful: Make clean, authenticated candidate records publicly accessible, free, and trustworthy."
    },
    "challenge": {
      "title": "Challenges With the Existing Process",
      "description": "The earlier workflow was heavily manual and inefficient:",
      "points": [
        "Manual Data Entry Between Systems - Admin manually re-entered candidate data from NationBuilder into TalentWise",
        "Multi-Step Email Reliance - Multiple back-and-forth emails between TalentWise, candidates, and admin for every verification",
        "Report Authenticity Issue - Candidates created manual images of reports which reduced credibility",
        "No Internal Record-Keeping - Zero internal database for candidate history, verification timestamps, or stored reports",
        "High Operational Cost - Admin involvement required at every stage, making the process time-consuming and expensive"
      ],
      "conclusion": "The client needed to automate and optimize the verification pipeline while reducing human involvement and operational cost.",
      "image": "https://images.pexels.com/photos/5668473/pexels-photo-5668473.jpeg?auto=compress&cs=tinysrgb&w=1920"
    },
    "solution": {
      "title": "Our Solution",
      "description": "We designed a fully integrated and automated system involving custom platform development, NationBuilder API integration, and webhook-driven automation.",
      "steps": [
        {
          "title": "1. Own Database & Activity Tracking",
          "description": "We created a dedicated system that stores candidate profiles, status updates, verification reports, approval logs, and widget generation data. This enabled 100% controlled, centralized tracking."
        },
        {
          "title": "2. Automated Webhook-Driven Sync",
          "description": "When a candidate registers on NationBuilder, a webhook automatically sends the data to our system, stores it instantly, and notifies admin with structured information. No manual entry required."
        },
        {
          "title": "3. Seamless TalentWise Integration",
          "description": "Admin can push candidate data in 1 step. Completed reports are uploaded to our system, and data is extracted automatically for widgets and profile display."
        },
        {
          "title": "4. Candidate Approval Workflow",
          "description": "Before publishing a candidate publicly, admin requests approval via system. Candidate receives secure link, and once approved, NationBuilder automatically displays the candidate."
        },
        {
          "title": "5. Widget Management System",
          "description": "Once verified, candidates can log in, customize their verification widget, get automatically generated embed code, and receive a dynamic verification image (tamper-proof). This solved the earlier 'fake image' problem with trusted, system-generated verification seals."
        }
      ],
      "image": "https://images.pexels.com/photos/3184291/pexels-photo-3184291.jpeg?auto=compress&cs=tinysrgb&w=1920"
    },
    "impact": {
      "title": "Impact Delivered",
      "description": "The automated system transformed their operations:",
      "points": [
        "80% Reduction in Admin Workload - Automation removed repetitive tasks",
        "Cost Savings - Eliminated dependency on Scribd and manual creation tools",
        "Transparent Candidate Verification - System-generated, trusted widgets improve credibility",
        "Complete Traceability - Every candidate, report, and approval stored with full history",
        "Professional & Scalable Workflow - Prepares the client for future expansion"
      ],
      "conclusion": "We helped CandidateVerification.org achieve their mission of political transparency through efficient, automated technology.",
      "image": "https://images.pexels.com/photos/3184465/pexels-photo-3184465.jpeg?auto=compress&cs=tinysrgb&w=1920"
    },
    "imageUrl": "https://images.pexels.com/photos/6476589/pexels-photo-6476589.jpeg?auto=compress&cs=tinysrgb&w=1920",
    "bannerImage": "https://images.pexels.com/photos/6476589/pexels-photo-6476589.jpeg?auto=compress&cs=tinysrgb&w=1920",
    "stats": [
      {
        "value": "80%",
        "label": "Less Admin Work"
      },
      {
        "value": "100%",
        "label": "Automated Sync"
      },
      {
        "value": "Zero",
        "label": "Manual Entry"
      },
      {
        "value": "Full",
        "label": "Traceability"
      }
    ],
    "testimonial": {
      "quote": "Finally, we are there! You made it. My selection of your team for this solution was perfect. Will forward you our maintenance contract to you. Thanks again for your all hard and smart work.",
      "author": "David Doud",
      "position": "CandidateVerification.org",
      "image": "/assets/review/david-doud.png"
    },
    "gradient": "from-blue-500 to-cyan-600",
    "icon": "shield"
  }
]